# Class 7: pandas Series and Data Frames

Today we will discuss pandas Series and DataFrames which allow us to analyze data tables.

## Notes on the class Jupyter setup

If you have the *ydata123_2024a* environment set up correctly, you can get the class code using the code below (which presumably you've already done given that you are seeing this notebook).

In [12]:
import YData

# YData.download.download_class_code(7)   # get class code    

# YData.download.download_class_code(7, True)  # get the code with the answers 


YData.download.download_data("dow.csv")
YData.download.download_data("monthly_egg_prices.csv")
YData.download.download_data("monthly_wheat_prices.csv")
YData.download.download_data("nba_salaries_2022_23.csv")
YData.download.download_data("nba_position_names.csv")

The file `dow.csv` already exists.
If you would like to download a new copy of the file, please rename the existing copy of the file.
The file `monthly_egg_prices.csv` already exists.
If you would like to download a new copy of the file, please rename the existing copy of the file.
The file `monthly_wheat_prices.csv` already exists.
If you would like to download a new copy of the file, please rename the existing copy of the file.
The file `nba_salaries_2022_23.csv` already exists.
If you would like to download a new copy of the file, please rename the existing copy of the file.
The file `nba_position_names.csv` already exists.
If you would like to download a new copy of the file, please rename the existing copy of the file.

There are also similar functions to download the homework:

In [13]:
# YData.download.download_homework(3)  # downloads the second homework

If you are using colabs, you should run the code below to load the YData package.

In [14]:
# !pip install https://github.com/emeyers/YData_package/tarball/master

If you are using google colabs, you should also uncomment and run the code below to mount the your google drive

In [15]:
# from google.colab import drive
# drive.mount('/content/drive')

## Boolean masking warm-up exercise

As a warm-up exercise, please calculate the total salary for players on the Boston Celtics and on the Golden State Warriors to see which team spent the most money on salaries. 

Hint: If you're stuck a useulf first step would be to create a Boolean masks indicating which players are on the Celtics...

In [16]:
# download the data
import YData
YData.download.download_data("nba_salaries_2022_23.csv")

The file `nba_salaries_2022_23.csv` already exists.
If you would like to download a new copy of the file, please rename the existing copy of the file.

In [17]:
# Extract the necessary data

# Load the NBA data as a pandas data frame
import pandas as pd
import numpy as np

nba = pd.read_csv("nba_salaries_2022_23.csv")  # load in the data
nba.head()


# Extract ndarrays for salary and position 
salary_array = nba["SALARY"].values
team_array = nba["TEAM"].values

np.unique(team_array)

array(['Atlanta Hawks', 'Boston Celtics', 'Brooklyn Nets',
       'Charlotte Bobcats', 'Chicago Bulls', 'Cleveland Cavaliers',
       'Dallas Mavericks', 'Denver Nuggets', 'Detroit Pistons',
       'Golden State Warriors', 'Houston Rockets', 'Indiana Pacers',
       'Los Angeles Clippers', 'Los Angeles Lakers', 'Memphis Grizzlies',
       'Miami Heat', 'Milwaukee Bucks', 'Minnesota Timberwolves',
       'New Orleans Hornets', 'New York Knicks', 'Oklahoma City Thunder',
       'Orlando Magic', 'Philadelphia 76ers', 'Phoenix Suns',
       'Portland Trail Blazers', 'Sacramento Kings', 'San Antonio Spurs',
       'Toronto Raptors', 'Utah Jazz', 'Washington Wizards'], dtype=object)

In [18]:
# Calculate the average salary for players on the Boston Celtics

celtics_mask = team_array == 'Boston Celtics'
celtics_salaries = salary_array[celtics_mask]
print(np.sum(celtics_salaries))

# Calculate the average salary for players on the Golden State Warriors

warriors_mask = team_array == 'Golden State Warriors'
warriors_salaries = salary_array[warriors_mask]
print(np.sum(warriors_salaries))

175.88349499999998
209.554954

## Tuples

Tuples are a basic data structure in Python that is like a list. However, unlike lists, elements in tuples are "immutable" meaning that once we create a tuple, we can not modify the values in the tuple.

We create tuples by using values in parentheses separated by commas:

`my_tuple = (10, 20, 30)`

Let's explore tuples now...

In [19]:
# create a tuple

my_tuple = (10, 20, 30)

my_tuple

(10, 20, 30)

In [20]:
# we can access elements of the tuple using square brackets (the same as lists)
my_tuple[1]

20

In [21]:
# unlike a list, we can't reassign values in a tuple 
my_tuple[1] = 50

TypeError: 'tuple' object does not support item assignment

In [73]:
# We extract values from tuples into regular names using "tuple unpacking"

val1, val2, val3 = my_tuple


val3

30

## Dictionaries

Dictionaries allow us to look up values. In particular, we provide a "key" and the dictionary return a "value". 

We can create dictionaries using the syntax: 

`my_dict = {"key1": 1, "key2": 20}`

In [74]:
# create a dictionary

my_dict = {"key1": 1, "key2": 20}
my_dict

{'key1': 1, 'key2': 20}

In [75]:
# we can access elements using square brackets 
my_dict["key2"]

20

In [76]:
# values in dictionaries can be list
my_dict2 = {"a": [1, 2, 3, 4], "b": ["a", "b", "c"], "c": [True, False]}
my_dict2["c"]

[True, False]

In [77]:
# We can create a dictionary from two lists of the same length using the dict() and zip() functions

my_list = [1, 2, 3]
my_list2 = ["a", "b", "c"]


# turn the lists into a dictionary using the zip() and dict() functions

my_dict3 = dict(zip(my_list2, my_list))


print(my_dict3)

my_dict3["b"]

{'a': 1, 'b': 2, 'c': 3}

2

In [78]:
# download the data basketball salary data

import YData
YData.download.download_data("nba_salaries_2022_23.csv")

The file `nba_salaries_2022_23.csv` already exists.
If you would like to download a new copy of the file, please rename the existing copy of the file.

In [79]:
# Load the NBA data as a pandas data frame
import pandas as pd
nba = pd.read_csv("nba_salaries_2022_23.csv")  # load in the data

# Extract ndarrays for salary and position 
salary_array = nba["SALARY"].values
player_array = nba["PLAYER"].values

print(salary_array[0:5])
print(player_array[0:5])

[ 9.835881  2.79264   3.53616   0.508891 23.5     ]
["De'Andre Hunter" 'Jalen Johnson' 'AJ Griffin' 'Trent Forrest'
 'John Collins']

In [80]:
# create a dictionary between players and their salaries
player_salaries = dict(zip(player_array, salary_array))

# what is Stephen Curry's salary? 
player_salaries["Stephen Curry"]

48.070014

## Pandas 

pandas Series are: 0ne-dimensional ndarray with axis labels

pands DataFrame are: Table data

Let's look at the egg and wheat price data...

In [81]:
YData.download.download_data("monthly_egg_prices.csv");
YData.download.download_data("dow.csv");

The file `monthly_egg_prices.csv` already exists.
If you would like to download a new copy of the file, please rename the existing copy of the file.
The file `dow.csv` already exists.
If you would like to download a new copy of the file, please rename the existing copy of the file.

In [82]:
# import the numpy package
import numpy as np
import matplotlib.pyplot as plt

import pandas as pd

In [83]:
# reading in a series by parsing the dates, and using .squeeze() to conver to a Series
egg_prices_series = pd.read_csv("monthly_egg_prices.csv", parse_dates=True, date_format="%m/%d/%y", index_col="DATE").squeeze()


# print the type
print(type(egg_prices_series))

# print the shape
print(egg_prices_series.shape)

# print the series
egg_prices_series

<class 'pandas.core.series.Series'>
(528,)

DATE
1980-01-01    0.879
1980-02-01    0.774
1980-03-01    0.812
1980-04-01    0.797
1980-05-01    0.737
              ...
2023-08-01    2.043
2023-09-01    2.065
2023-10-01    2.072
2023-11-01    2.138
2023-12-01    2.507
Name: Price, Length: 528, dtype: float64

In [84]:
# get a value from the Series by an Index name using .loc
egg_prices_series.loc["1980-01-01"]

0.879

In [85]:
# get a value from the Series by index number using .iloc
egg_prices_series.iloc[0]

0.879

In [86]:
# use the .filter() method to get data from dates that contain "2023"
egg_prices_2023 = egg_prices_series.filter(like='2023')

# print the length 
print(len(egg_prices_2023))

egg_prices_2023

12

DATE
2023-01-01    4.823
2023-02-01    4.211
2023-03-01    3.446
2023-04-01    3.270
2023-05-01    2.666
2023-06-01    2.219
2023-07-01    2.094
2023-08-01    2.043
2023-09-01    2.065
2023-10-01    2.072
2023-11-01    2.138
2023-12-01    2.507
Name: Price, dtype: float64

In [87]:
# turn the index back into a column using .reset_index()
egg_prices_df = egg_prices_series.reset_index()

# get the type
print(type(egg_prices_df))

# print the values
egg_prices_df

<class 'pandas.core.frame.DataFrame'>

          DATE  Price
0   1980-01-01  0.879
1   1980-02-01  0.774
2   1980-03-01  0.812
3   1980-04-01  0.797
4   1980-05-01  0.737
..         ...    ...
523 2023-08-01  2.043
524 2023-09-01  2.065
525 2023-10-01  2.072
526 2023-11-01  2.138
527 2023-12-01  2.507

[528 rows x 2 columns]

## DataFrames!

The ability to manipulate data in tables is one of the most useful skills in Data Science. 

Pandas is the most popular package in Python for manipulating data tables so we will use this package for manipulating tables in this class. The syntax for Pandas can be a little tricky, so try to be patient if you run into errors, and as always, there should be plenty of help available at office hours and on Ed. 

As an example, let's look at data on the closing price of the [Dow Jones Industrial Average](https://www.marketwatch.com/investing/index/djia) which is an index of the prices of the 30 largest corporations in the US.

The code below loads the DOW data into a Pandas DataFrame and displays the first 5 rows using the `head()` method.

In [88]:
dow = pd.read_csv("dow.csv", parse_dates=[0], date_format="%m/%d/%y", index_col="Date")

dow.head()

,Year,Month,Day,Open,High,Low,Close,Volume
Date,,,,,,,,
1992-01-02,1992,1,Thursday,3152.100098,3172.629883,3139.310059,3172.399902,23550000
1992-01-03,1992,1,Friday,3172.399902,3210.639893,3165.919922,3201.500000,23620000
1992-01-06,1992,1,Monday,3201.500000,3213.330078,3191.860107,3200.100098,27280000
1992-01-07,1992,1,Tuesday,3200.100098,3210.199951,3184.479980,3204.800049,25510000
1992-01-08,1992,1,Wednesday,3204.800049,3229.199951,3185.820068,3203.899902,29040000

In [89]:
# The head() method returns the first 5 rows. 
# Let's use the tail() method to get the last 5 rows.
# From looking at the output, can you tell what year the data goes back until? 

dow.tail()

,Year,Month,Day,Open,High,Low,Close,Volume
Date,,,,,,,,
2024-01-25,2024,1,Thursday,37862.570312,38057.531250,37796.468750,38049.128906,402970000
2024-01-26,2024,1,Friday,38006.679688,38215.308594,37997.769531,38109.429688,387000000
2024-01-29,2024,1,Monday,38115.828125,38343.929688,38061.171875,38333.449219,312480000
2024-01-30,2024,1,Tuesday,38298.230469,38497.390625,38257.800781,38467.308594,326640000
2024-01-31,2024,1,Wednesday,38426.781250,38588.859375,38139.660156,38150.300781,453250000

In [90]:
# get the number of rows and columns in a DataFrame using the shape property
dow.shape

(8080, 8)

In [91]:
# get the types of all the columns using .dtypes
dow.dtypes

Year        int64
Month       int64
Day        object
Open      float64
High      float64
Low       float64
Close     float64
Volume      int64
dtype: object

In [92]:
# get the names of all the columns using .columns
print(dow.columns)

# we can convert these names to an numpy array using the .to_numpy() method
dow.columns.to_numpy()

Index(['Year', 'Month', 'Day', 'Open', 'High', 'Low', 'Close', 'Volume'], dtype='object')

array(['Year', 'Month', 'Day', 'Open', 'High', 'Low', 'Close', 'Volume'],
      dtype=object)

In [93]:
# get more info on the data frame using the .info() method
dow.info()

<class 'pandas.core.frame.DataFrame'>
Index: 8080 entries, 1992-01-02 to 2024-01-31
Data columns (total 8 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Year    8080 non-null   int64
 1   Month   8080 non-null   int64
 2   Day     8080 non-null   object
 3   Open    8080 non-null   float64
 4   High    8080 non-null   float64
 5   Low     8080 non-null   float64
 6   Close   8080 non-null   float64
 7   Volume  8080 non-null   int64
dtypes: float64(4), int64(3), object(1)
memory usage: 568.1+ KB

In [94]:
# get descriptive statistics on DataFrame using the .describe() method

dow.describe().round()   # round() the values, or can convert them to ints using astype("int")

         Year   Month     Open     High      Low    Close       Volume
count  8080.0  8080.0   8080.0   8080.0   8080.0   8080.0       8080.0
mean   2008.0     7.0  14301.0  14386.0  14213.0  14304.0  193183481.0
std       9.0     3.0   8826.0   8870.0   8780.0   8827.0  131129922.0
min    1992.0     1.0   3137.0   3173.0   3096.0   3137.0    8410000.0
25%    1999.0     4.0   8777.0   8855.0   8679.0   8781.0   79940000.0
50%    2008.0     7.0  11067.0  11144.0  10987.0  11069.0  191610000.0
75%    2016.0    10.0  17882.0  17951.0  17792.0  17886.0  278192500.0
max    2024.0    12.0  38427.0  38589.0  38258.0  38467.0  915990000.0

### Selecting columns from a DataFrame

We can select columns from a DataFrame using the square brackets; e.g., `my_df["my_col"]`

If we'd like to select multiple columns we can pass a list; e.g., `my_df[["col1", "col2"]]`

In [95]:
# Get just the DOW close price
# Be careful: if you just use a ["Col_name"] it will return it as a Series!

close_price = dow["Close"]

close_price.head()

Date
1992-01-02    3172.399902
1992-01-03    3201.500000
1992-01-06    3200.100098
1992-01-07    3204.800049
1992-01-08    3203.899902
Name: Close, dtype: float64

In [96]:
# we can also get a single column using the .col_name 

close_price2 = dow.Close

close_price2.head()

Date
1992-01-02    3172.399902
1992-01-03    3201.500000
1992-01-06    3200.100098
1992-01-07    3204.800049
1992-01-08    3203.899902
Name: Close, dtype: float64

In [97]:
# if you want to get a single column as a DataFrame, pass a list in the [] brackets
close_price = dow[["Close"]]

close_price.head()

                  Close
Date
1992-01-02  3172.399902
1992-01-03  3201.500000
1992-01-06  3200.100098
1992-01-07  3204.800049
1992-01-08  3203.899902

In [98]:
# Get both the open and close price
open_close_price = dow[["Open", "Close"]]

open_close_price

                    Open         Close
Date
1992-01-02   3152.100098   3172.399902
1992-01-03   3172.399902   3201.500000
1992-01-06   3201.500000   3200.100098
1992-01-07   3200.100098   3204.800049
1992-01-08   3204.800049   3203.899902
...                  ...           ...
2024-01-25  37862.570312  38049.128906
2024-01-26  38006.679688  38109.429688
2024-01-29  38115.828125  38333.449219
2024-01-30  38298.230469  38467.308594
2024-01-31  38426.781250  38150.300781

[8080 rows x 2 columns]

### Getting a subset of rows from a DataFrame

Similar to pandas Series, we can get particular rows from a DataFrame using:

- `.loc`:  Get rows by Index values - and by Boolean masks
- `.iloc`.:  Get rows by their index number

In [99]:
# Extract a row based on the Index name "2024-01-25"
dow.loc["2024-01-25"]

Year              2024
Month                1
Day           Thursday
Open      37862.570312
High       38057.53125
Low        37796.46875
Close     38049.128906
Volume       402970000
Name: 2024-01-25, dtype: object

In [100]:
# Extract a row based on the row number (get row 0)
dow.iloc[0]

Year             1992
Month               1
Day          Thursday
Open      3152.100098
High      3172.629883
Low       3139.310059
Close     3172.399902
Volume       23550000
Name: 1992-01-02, dtype: object

In [101]:
# We can get multiple rows that meet particular conditions using Boolean masking

booleans_in_2023 = dow["Year"] == 2023

booleans_in_2023

Date
1992-01-02    False
1992-01-03    False
1992-01-06    False
1992-01-07    False
1992-01-08    False
              ...
2024-01-25    False
2024-01-26    False
2024-01-29    False
2024-01-30    False
2024-01-31    False
Name: Year, Length: 8080, dtype: bool

In [102]:
# extract the 2023 values using our Boolean mask
dow.loc[booleans_in_2023]   # actually works even without the .loc

,Year,Month,Day,Open,High,Low,Close,Volume
Date,,,,,,,,
2023-01-03,2023,1,Tuesday,33148.898438,33387.519531,32850.570312,33136.371094,355930000
2023-01-04,2023,1,Wednesday,33165.140625,33409.101562,33033.480469,33269.769531,379400000
2023-01-05,2023,1,Thursday,33191.718750,33191.718750,32812.328125,32930.078125,337920000
2023-01-06,2023,1,Friday,33055.300781,33710.660156,32997.390625,33630.609375,360740000
2023-01-09,2023,1,Monday,33664.390625,33935.109375,33487.660156,33517.648438,327840000
...,...,...,...,...,...,...,...,...
2023-12-22,2023,12,Friday,37349.269531,37534.519531,37268.878906,37385.968750,252970000
2023-12-26,2023,12,Tuesday,37405.898438,37617.988281,37371.828125,37545.328125,212420000
2023-12-27,2023,12,Wednesday,37518.621094,37683.699219,37488.601562,37656.519531,245530000
2023-12-28,2023,12,Thursday,37661.519531,37778.851562,37650.980469,37710.101562,199550000
2023-12-29,2023,12,Friday,37701.628906,37759.429688,37538.800781,37689.539062,234570000

In [103]:
# Can you get the mean DOW close value in 2023? 
data_2023 = dow[dow.Year == 2023]

print(data_2023["Close"].mean())   # using the Series mean() function

np.mean(data_2023["Close"])  # can also use np.mean()

34121.5368984375

34121.5368984375

### Sorting values in a DataFrame

We can sort values in a DataFrame using `.sort_values("col_name")`

We can sort from highest to lowest by setting the argument `ascending = False`

In [104]:
# Sort the data by the Close value
dow.sort_values("Close").head()

,Year,Month,Day,Open,High,Low,Close,Volume
Date,,,,,,,,
1992-10-09,1992,10,Friday,3176.000000,3176.300049,3131.719971,3136.600098,19310000
1992-10-07,1992,10,Wednesday,3178.199951,3187.909912,3145.770020,3152.300049,19530000
1992-01-02,1992,1,Thursday,3152.100098,3172.629883,3139.310059,3172.399902,23550000
1992-10-16,1992,10,Friday,3174.699951,3180.350098,3142.530029,3174.399902,40880000
1992-10-12,1992,10,Monday,3136.600098,3174.679932,3136.310059,3174.399902,14260000

In [105]:
# What is the highest the DOW has been? 
dow.sort_values("Close", ascending = False).head()

,Year,Month,Day,Open,High,Low,Close,Volume
Date,,,,,,,,
2024-01-30,2024,1,Tuesday,38298.230469,38497.390625,38257.800781,38467.308594,326640000
2024-01-29,2024,1,Monday,38115.828125,38343.929688,38061.171875,38333.449219,312480000
2024-01-31,2024,1,Wednesday,38426.781250,38588.859375,38139.660156,38150.300781,453250000
2024-01-26,2024,1,Friday,38006.679688,38215.308594,37997.769531,38109.429688,387000000
2024-01-25,2024,1,Thursday,37862.570312,38057.531250,37796.468750,38049.128906,402970000

### Adding new columns to a Data Frame

We can add a column to a data frame using square backets. For example: 

- `my_df["new col"] = my_df["col1"] + my_df["col2"]`.

Percent change is defined as: $100 * \frac{final - initial}{initial}$

Can you add a "Percent change" column to the dow2 data (which is a copy of the dow data comparing closing and opening prices?  What is the biggest percent change in the dow?

In [106]:
# copy the data to dow2
dow2 = dow.copy()

# add percent change column
dow2["Percent change"] = 100 * (dow2["Close"] - dow2["Open"])/dow2["Open"]

# sort the data
dow2.sort_values("Percent change").head()

,Year,Month,Day,Open,High,Low,Close,Volume,Percent change
Date,,,,,,,,,
2008-10-15,2008,10,Wednesday,9301.910156,9308.759766,8530.120117,8577.910156,374350000,-7.783348
2008-12-01,2008,12,Monday,8826.889648,8827.049805,8141.359863,8149.089844,321010000,-7.678807
2008-10-09,2008,10,Thursday,9261.690430,9448.139648,8579.190430,8579.190430,436740000,-7.369065
1997-10-27,1997,10,Monday,7714.399902,7714.419922,7159.919922,7161.200195,91830000,-7.171001
2008-09-29,2008,9,Monday,11139.620117,11139.940430,10365.450195,10365.450195,385940000,-6.949698

In [107]:
# sort the data from largest to smallest
dow2.sort_values("Percent change", ascending = False).head() 

# This is actually not historically correct for older dates. 
# See if you can figure out how to calculate the actual largest percent changes.

,Year,Month,Day,Open,High,Low,Close,Volume,Percent change
Date,,,,,,,,,
2008-10-13,2008,10,Monday,8462.419922,9427.990234,8462.179688,9387.610352,399290000,10.932930
2008-10-28,2008,10,Tuesday,8178.720215,9082.080078,8174.729980,9065.120117,372160000,10.837880
2009-03-23,2009,3,Monday,7279.250000,7780.720215,7278.779785,7775.859863,515600000,6.822267
2008-11-13,2008,11,Thursday,8281.139648,8876.589844,7965.419922,8835.250000,476600000,6.691233
2008-11-21,2008,11,Friday,7552.370117,8071.750000,7449.379883,8046.419922,569010000,6.541652

We can rename columns by:
1. Creating a `rename_dictionary` dictionary that maps old column names to new column names
2. By passing this dictionary to the `my_df.rename(columns = rename_dictionary)` method

In [127]:
# Rename the Percent change column
rename_dictionary = {"Percent change": "Woot"}
dow2 = dow2.rename(columns = rename_dictionary)
dow2.head(3)

,Year,Month,Day,Open,High,Low,Close,Volume,Woot
Date,,,,,,,,,
1992-01-02,1992,1,Thursday,3152.100098,3172.629883,3139.310059,3172.399902,23550000,0.644009
1992-01-03,1992,1,Friday,3172.399902,3210.639893,3165.919922,3201.500000,23620000,0.917290
1992-01-06,1992,1,Monday,3201.500000,3213.330078,3191.860107,3200.100098,27280000,-0.043726

### Getting aggregate statistics by group

We can get aggregate statistics by group using `groupby()` and `agg` methods using the following syntax:

`my_df.groupby("col_name").agg("agg_function_name")`

Can you get the max values of the DOW each year?

In [128]:
# What was the max values of the DOW each year? 

max_close = dow[["Year", "Close"]].groupby("Year").agg("max")
max_close.head()

            Close
Year
1992  3413.199951
1993  3794.330078
1994  3978.360107
1995  5216.470215
1996  6560.910156

There are several ways to get multiple statistics by group. Perhaps the most useful way is to use the syntax:

<pre>
my_df.groupby("group_col_name").agg(
   new_col1 = ('col_name', 'statistic_name1'),
   new_col2 = ('col_name', 'statistic_name2'),
   new_col3 = ('col_name', 'statistic_name3')
)
</pre>


Let's create a DataFrame that has the number of trading days, the minimum and the maximum DOW value for each year.

In [110]:
dow.groupby('Year').agg(
    countClose = ('Close', 'count'),
    minClose = ('Close', 'min'),
    maxClose=('Close', 'max')
)

      countClose      minClose      maxClose
Year
1992         254   3136.600098   3413.199951
1993         253   3242.000000   3794.330078
1994         252   3593.350098   3978.360107
1995         252   3832.080078   5216.470215
1996         254   5032.939941   6560.910156
1997         253   6391.700195   8259.299805
1998         252   7539.069824   9374.269531
1999         252   9120.669922  11497.120117
2000         252   9796.030273  11722.980469
2001         248   8235.809570  11337.919922
2002         252   7286.270020  10635.250000
2003         252   7524.060059  10453.919922
2004         252   9749.990234  10854.540039
2005         252  10012.360352  10940.549805
2006         251  10667.389648  12510.570312
2007         251  12050.410156  14164.530273
2008         253   7552.290039  13058.200195
2009         252   6547.049805  10548.509766
2010         252   9686.480469  11585.379883
2011         252  10655.299805  12810.540039
2012         250  12101.459961  13610.150391
2013         252  13328.849609  16576.660156
2014         252  15372.799805  18053.710938
2015         252  15666.440430  18312.390625
2016         252  15660.179688  19974.619141
2017         251  19732.400391  24837.509766
2018         251  21792.199219  26828.390625
2019         252  22686.220703  28645.259766
2020         253  18591.929688  30606.480469
2021         252  29982.619141  36488.628906
2022         251  28725.509766  36799.648438
2023         250  31819.140625  37710.101562
2024          21  37266.671875  38467.308594

![pandas](https://image.goat.com/transform/v1/attachments/product_template_additional_pictures/images/071/445/310/original/719082_01.jpg.jpeg)

### "Joining" DataFrames by Index

To explore joining DataFrames, let's load the egg and wheat prices as DataFrames. 

We will also:
- Rename the Price colomns to Egg Price and Wheat Price
- Set the Index to be the date


When two DataFrames have the same Index values, we can use the `.join()` method to join them.

In [111]:
# load the egg and wheat prices as DataFrames
egg_price_df = pd.read_csv("monthly_egg_prices.csv", parse_dates=True, date_format="%m/%d/%y", index_col= "DATE")
egg_price_df = egg_price_df.rename(columns = {"Price":"Egg Price"})
egg_price_df.head(3)

            Egg Price
DATE
1980-01-01      0.879
1980-02-01      0.774
1980-03-01      0.812

In [112]:
wheat_price_df = pd.read_csv("monthly_wheat_prices.csv", parse_dates=True, date_format="%m/%d/%y", index_col= "DATE")
wheat_price_df = wheat_price_df.rename(columns = {"Price":"Wheat Price"})
wheat_price_df.head(3)

            Wheat Price
DATE
1990-01-01   167.918579
1990-02-01   160.937271
1990-03-01   156.528030

In [113]:
# Let's do a left join by setting how = "left"
# This will give same results as an outer join b/c the egg_price_df has all (and more) index values as the wheat_prices_df
left_joined = egg_price_df.join(wheat_price_df, how = "left") 
left_joined

            Egg Price  Wheat Price
DATE
1980-01-01      0.879          NaN
1980-02-01      0.774          NaN
1980-03-01      0.812          NaN
1980-04-01      0.797          NaN
1980-05-01      0.737          NaN
...               ...          ...
2023-08-01      2.043   241.413878
2023-09-01      2.065   229.390711
2023-10-01      2.072   216.463939
2023-11-01      2.138   216.000269
2023-12-01      2.507   229.633413

[528 rows x 2 columns]

In [114]:
# Let's do a right join by setting how = "right"  
# This will give same results as an inner join b/c the egg_price_df has all (and more) index values as the wheat_prices_df
right_joined = egg_price_df.join(wheat_price_df, how = "right") 
right_joined

            Egg Price  Wheat Price
DATE
1990-01-01      1.223   167.918579
1990-02-01      1.041   160.937271
1990-03-01      1.111   156.528030
1990-04-01      1.092   159.467529
1990-05-01      0.940   149.179291
...               ...          ...
2023-08-01      2.043   241.413878
2023-09-01      2.065   229.390711
2023-10-01      2.072   216.463939
2023-11-01      2.138   216.000269
2023-12-01      2.507   229.633413

[408 rows x 2 columns]

### "Merging" DataFrames by column values

If we want to join by value in a column rather than by Index value we can use the `.merge()` method (which is very similar to the `.join()` method).

In [115]:
# reset the index of eggs to make DATE a column
egg_price_df2 = egg_price_df.reset_index()
egg_price_df2.head(3)

        DATE  Egg Price
0 1980-01-01      0.879
1 1980-02-01      0.774
2 1980-03-01      0.812

In [116]:
# reset the index of wheat to make DATE a column

wheat_price_df2 = wheat_price_df.reset_index()

wheat_price_df2.head(3)

        DATE  Wheat Price
0 1990-01-01   167.918579
1 1990-02-01   160.937271
2 1990-03-01   156.528030

In [117]:
# use the .merge() method to join the DataFrames

left_joined2 = egg_price_df2.merge(wheat_price_df2, how = "left") 
left_joined2

          DATE  Egg Price  Wheat Price
0   1980-01-01      0.879          NaN
1   1980-02-01      0.774          NaN
2   1980-03-01      0.812          NaN
3   1980-04-01      0.797          NaN
4   1980-05-01      0.737          NaN
..         ...        ...          ...
523 2023-08-01      2.043   241.413878
524 2023-09-01      2.065   229.390711
525 2023-10-01      2.072   216.463939
526 2023-11-01      2.138   216.000269
527 2023-12-01      2.507   229.633413

[528 rows x 3 columns]

#### Merging with different column names

What if the columns we want to join on have different names, we can use the `left_on` and `right_on` arguments to specify which columns (i.e., keys) should be used to align the two DataFrames

In [118]:
egg_price_df3 = egg_price_df2.rename(columns = {"DATE":"Egg DATE"})
wheat_price_df3 = wheat_price_df2.rename(columns = {"DATE": "Wheat DATE"})

wheat_price_df3.head(3)

  Wheat DATE  Wheat Price
0 1990-01-01   167.918579
1 1990-02-01   160.937271
2 1990-03-01   156.528030

In [119]:
egg_price_df3.head(3)

    Egg DATE  Egg Price
0 1980-01-01      0.879
1 1980-02-01      0.774
2 1980-03-01      0.812

In [120]:
# merge the DataFrames specifying the column names to join on

left_joined3 = egg_price_df3.merge(wheat_price_df3, how = "left", left_on = "Egg DATE", right_on = "Wheat DATE") 
left_joined3

      Egg DATE  Egg Price Wheat DATE  Wheat Price
0   1980-01-01      0.879        NaT          NaN
1   1980-02-01      0.774        NaT          NaN
2   1980-03-01      0.812        NaT          NaN
3   1980-04-01      0.797        NaT          NaN
4   1980-05-01      0.737        NaT          NaN
..         ...        ...        ...          ...
523 2023-08-01      2.043 2023-08-01   241.413878
524 2023-09-01      2.065 2023-09-01   229.390711
525 2023-10-01      2.072 2023-10-01   216.463939
526 2023-11-01      2.138 2023-11-01   216.000269
527 2023-12-01      2.507 2023-12-01   229.633413

[528 rows x 4 columns]

#### Example: Spelling out NBA position names

As you will recall, our NBA salaries DataFrame had the different positions listed as abbreviations such as "C" and "PG". 

Often it is hard to tell what these abbreviations (or codes) mean, so a common use of joining is to join on to a table a list of longer names that give more meaning to abbreviations. 

Below we load our `nba_salaries` DataFrame along with a `nba_positions` DataFrame which has information about how each position abbreviation maps on to the position's full name.

Let's merge these DataFrames together so that our `nba_salaries` DataFrame has the full position names!

In [121]:
nba_salaries = pd.read_csv("nba_salaries_2022_23.csv")

nba_salaries.head(3)

            PLAYER POSITION           TEAM    SALARY
0  De'Andre Hunter       SF  Atlanta Hawks  9.835881
1    Jalen Johnson       SF  Atlanta Hawks  2.792640
2       AJ Griffin       SF  Atlanta Hawks  3.536160

In [122]:
nba_positions = pd.read_csv("nba_position_names.csv")
nba_positions

  Position Abbreviation   Position Name
0                    PG     Point Guard
1                    SG  Shooting Guard
2                     C          Center
3                    SF   Small Forward
4                    PF   Power Forward

In [123]:
# merge the DataFrames together so each player's position is the full position name

nba_improved = nba_salaries.merge(nba_positions, left_on = "POSITION", right_on = "Position Abbreviation")

nba_improved.head(5)

,PLAYER,POSITION,TEAM,SALARY,Position Abbreviation,Position Name
0,De'Andre Hunter,SF,Atlanta Hawks,9.835881,SF,Small Forward
1,Jalen Johnson,SF,Atlanta Hawks,2.792640,SF,Small Forward
2,AJ Griffin,SF,Atlanta Hawks,3.536160,SF,Small Forward
3,Jarrett Culver,SF,Atlanta Hawks,0.260295,SF,Small Forward
4,Justin Champagnie,SF,Boston Celtics,0.853241,SF,Small Forward

In [124]:
# remove unnecessary columns using the .drop(colums = )  method
nba_improved.drop(columns = ["POSITION", "Position Abbreviation"])

                PLAYER                TEAM     SALARY  Position Name
0      De'Andre Hunter       Atlanta Hawks   9.835881  Small Forward
1        Jalen Johnson       Atlanta Hawks   2.792640  Small Forward
2           AJ Griffin       Atlanta Hawks   3.536160  Small Forward
3       Jarrett Culver       Atlanta Hawks   0.260295  Small Forward
4    Justin Champagnie      Boston Celtics   0.853241  Small Forward
..                 ...                 ...        ...            ...
462       Kelly Olynyk           Utah Jazz  12.804878         Center
463     Udoka Azubuike           Utah Jazz   2.174880         Center
464         Taj Gibson  Washington Wizards   2.905851         Center
465     Daniel Gafford  Washington Wizards   1.930681         Center
466           Jay Huff  Washington Wizards   0.116986         Center

[467 rows x 4 columns]